# Напишіть програму, яка запитує у користувача два логічні значення (True або
# False) і виводить результати наступних логічних операцій:

# Логічне І (and) між двома значеннями.
# Логічне АБО (or) між двома значеннями.
# Логічне НЕ (not) кожного значення.
# Результат порівняння двох значень на рівність.
# Результат порівняння двох значень на нерівність.

# Результати мають бути виведені за допомогою print. Введену строку "True"
# або "False" треба привести до булевого типу "True" або "False" і потім вже
# над булевими значеннями проводити операції.

first_bool = input('Введіть перше логічне значення:')
second_bool = input('Введіть друге логічне значення:')

if first_bool == 'True':
    first_bool = True
else:
    first_bool = False

if second_bool == 'True':
    second_bool = True
else:
    second_bool = False

print('Логічне І (and) між двома значеннями:', first_bool and second_bool)
print('Логічне АБО (or) між двома значеннями:', first_bool or second_bool)
print('Логічне НЕ (not) першого значення:', not first_bool)
print('Логічне НЕ (not) другого значення:', not second_bool)
print('Результат порівняння двох значень на рівність:', first_bool == second_bool)
print('Результат порівняння двох значень на нерівність:', first_bool != second_bool)
